package com.dace.dmgr.combat.action.weapon;

import com.dace.dmgr.combat.action.weapon.module.FullAutoModule;
import lombok.AllArgsConstructor;
import lombok.Getter;
import lombok.NonNull;

/**
 * 쿨타임이 5틱 이하인 연사가 가능한 무기의 인터페이스.
 */
public interface FullAuto extends Weapon {
    /**
     * @return 연사 모듈
     */
    @NonNull
    FullAutoModule getFullAutoModule();

    /**
     * 지정할 수 있는 연사속도의 목록.
     */
    @AllArgsConstructor
    @Getter
    enum FireRate {
        /** 300/분 (5/초) */
        RPM_300(0b0_0001_0001_0001_0001_0001, 300),
        /** 360/분 (6/초) */
        RPM_360(0b0_0010_0100_0100_1000_1001, 360),
        /** 420/분 (7/초) */
        RPM_420(0b0_0100_1001_0010_0100_1001, 420),
        /** 480/분 (8/초) */
        RPM_480(0b0_0010_1001_0100_1010_0101, 480),
        /** 540/분 (9/초) */
        RPM_540(0b0_0101_0100_1010_1001_0101, 540),
        /** 600/분 (10/초) */
        RPM_600(0b0_0101_0101_0101_0101_0101, 600),
        /** 660/분 (11/초) */
        RPM_660(0b0_0101_0101_0101_0101_0111, 660),
        /** 720/분 (12/초) */
        RPM_720(0b0_0101_1010_1101_0110_1011, 720),
        /** 780/분 (13/초) */
        RPM_780(0b0_0101_1101_0111_0101_1101, 780),
        /** 840/분 (14/초) */
        RPM_840(0b0_1101_1011_0110_1101_1011, 840),
        /** 900/분 (15/초) */
        RPM_900(0b0_0111_0111_0111_0111_0111, 900),
        /** 960/분 (16/초) */
        RPM_960(0b0_0111_1011_1101_1110_1111, 960),
        /** 1020/분 (17/초) */
        RPM_1020(0b0_1101_1111_0111_1101_1111, 1020),
        /** 1080/분 (18/초) */
        RPM_1080(0b0_0111_1111_1101_1111_1111, 1080),
        /** 1140/분 (19/초) */
        RPM_1140(0b0_0111_1111_1111_1111_1111, 1140),
        /** 1200/분 (20/초) */
        RPM_1200(0b0_1111_1111_1111_1111_1111, 1200);

        /** 발사 시점 확인 플래그 */
        private final int tickFlag;
        /** 분당 발사속도 */
        private final int roundsPerMinute;
    }
}